cask_args appdir: "/Applications"

brew "zsh"
brew "zsh-completion"
brew "tmux"
brew "vim"
brew "jq"
brew "wget"
brew "pwgen"
brew "docker-buildx"
brew "gnu-sed"
brew "yq"
brew "mise"

cask "alfred"
cask "orbstack"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "bettertouchtool"
cask "visual-studio-code"
cask "notion"
cask "deepl"
cask "google-cloud-sdk"

# cask "google-chrome"
# cask "slack"
# cask "1password"

vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "streetsidesoftware.code-spell-checker"
