cask_args appdir: "/Applications"

brew "zsh"
brew "zsh-completion"
brew "tmux"
brew "vim"
brew "jq"
brew "wget"
brew "pwgen"
brew "gnu-sed"
brew "yq"
brew "starship"
brew "fzf"
brew "zoxide"
brew "direnv"
brew "ffmpeg"
brew "mise"
brew "docker"

cask "alfred"
cask "cursor"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "bettertouchtool"
cask "deepl"
cask "docker-desktop"
cask "gcloud-cli"
cask "1password-cli"

# cask "google-chrome"
# cask "slack"
# cask "1password"
# cask "notion"