cask_args appdir: "/Applications"

brew "zsh"
brew "zsh-completion"
brew "tmux"
brew "vim"
brew "jq"
brew "goenv", args: ["HEAD"]
brew "pyenv"
brew "pyenv-virtualenv"
brew "http://git.io/sshpass.rb"
brew "mysql-client@5.7"
brew "protobuf"
brew "octant"
brew "kubectx"
brew "stern"
brew "minikube"
brew "kind"
brew "github/gh/gh"
brew "wget"
brew "pwgen"
brew "nodebrew"
brew "plantuml"
brew "lua"
brew "pwgen"
brew "helm"
brew "wireshark"

cask "alfred"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "slack"
cask "bettertouchtool"
cask "kindle"
cask "sequel-pro"
